In [1]:
import numpy as np
import pandas as pd

In [112]:
df = pd.read_csv('data.csv',index_col='index')
df.head()

           data
index
0      0.061199
1     -0.659804
2      0.340600
3     -1.094073
4      0.751611

In [103]:
df1 = df[:500]
df1.head()

           data
index
0      0.061199
1     -0.659804
2      0.340600
3     -1.094073
4      0.751611

In [104]:
df2 = df[500:]
df2.head()

           data
index
500   -0.621926
501    0.771320
502    1.412807
503    0.641474
504   -1.035259

In [105]:
# concat, join, merge

In [107]:
df_concat = pd.concat([df1,df2])
df_concat

           data
index
0      0.061199
1     -0.659804
2      0.340600
3     -1.094073
4      0.751611
...         ...
995    0.622426
996   -0.755656
997    1.806369
998    0.670597
999    1.932249

[1000 rows x 1 columns]

In [108]:
df_concat = pd.concat([df1,df2],axis=1)
df_concat

           data      data
index
0      0.061199       NaN
1     -0.659804       NaN
2      0.340600       NaN
3     -1.094073       NaN
4      0.751611       NaN
...         ...       ...
995         NaN  0.622426
996         NaN -0.755656
997         NaN  1.806369
998         NaN  0.670597
999         NaN  1.932249

[1000 rows x 2 columns]

In [109]:
df_concat = pd.concat([df1,df2],axis=1, ignore_index=True)
df_concat

              0         1
index
0      0.061199       NaN
1     -0.659804       NaN
2      0.340600       NaN
3     -1.094073       NaN
4      0.751611       NaN
...         ...       ...
995         NaN  0.622426
996         NaN -0.755656
997         NaN  1.806369
998         NaN  0.670597
999         NaN  1.932249

[1000 rows x 2 columns]

In [110]:
df2.index = df1.index

In [114]:
df_concat = pd.concat([df1,df2])
df_concat

           data
index
0      0.061199
1     -0.659804
2      0.340600
3     -1.094073
4      0.751611
...         ...
495    0.622426
496   -0.755656
497    1.806369
498    0.670597
499    1.932249

[1000 rows x 1 columns]

In [115]:
df_concat.loc[1]

           data
index
1     -0.659804
1      0.771320

In [118]:
df_concat = pd.concat([df1,df2],ignore_index=True)
df_concat

         data
0    0.061199
1   -0.659804
2    0.340600
3   -1.094073
4    0.751611
..        ...
995  0.622426
996 -0.755656
997  1.806369
998  0.670597
999  1.932249

[1000 rows x 1 columns]

In [119]:
df_concat.loc[1]

data   -0.659804
Name: 1, dtype: float64

In [121]:
df_concat = pd.concat([df1,df2], axis=1)
df_concat

           data      data
index
0      0.061199 -0.621926
1     -0.659804  0.771320
2      0.340600  1.412807
3     -1.094073  0.641474
4      0.751611 -1.035259
...         ...       ...
495    1.213416  0.622426
496    0.738298 -0.755656
497    1.112194  1.806369
498   -0.044470  0.670597
499    0.517243  1.932249

[500 rows x 2 columns]

In [122]:
 df2 = df[500:]
 df2

           data
index
500   -0.621926
501    0.771320
502    1.412807
503    0.641474
504   -1.035259
...         ...
995    0.622426
996   -0.755656
997    1.806369
998    0.670597
999    1.932249

[500 rows x 1 columns]

In [132]:
df1.columns = ['number']
df2.columns = ['graph']

In [142]:
df1 = df1.reset_index()
df2 = df2.reset_index()

In [144]:
df_concat = pd.concat([df1,df2], axis=1)
df_concat

     index    number  index     graph
0        0  0.061199    500 -0.621926
1        1 -0.659804    501  0.771320
2        2  0.340600    502  1.412807
3        3 -1.094073    503  0.641474
4        4  0.751611    504 -1.035259
..     ...       ...    ...       ...
495    495  1.213416    995  0.622426
496    496  0.738298    996 -0.755656
497    497  1.112194    997  1.806369
498    498 -0.044470    998  0.670597
499    499  0.517243    999  1.932249

[500 rows x 4 columns]

In [146]:
# merge

df = pd.read_csv('data.csv',index_col='index')
df1 = df[:500]
df2 = df[500:]

In [148]:
df_merge = pd.merge(df1,df2)
df_merge

Empty DataFrame
Columns: [data]
Index: []

In [163]:
# new

df3 = pd.DataFrame({'number':df1.data.values, 'graph':df2.data.values}, index=df1.index)
df3

         number     graph
index
0      0.061199 -0.621926
1     -0.659804  0.771320
2      0.340600  1.412807
3     -1.094073  0.641474
4      0.751611 -1.035259
...         ...       ...
495    1.213416  0.622426
496    0.738298 -0.755656
497    1.112194  1.806369
498   -0.044470  0.670597
499    0.517243  1.932249

[500 rows x 2 columns]

In [165]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,10], columns={'data'})
df

   data
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10

In [189]:
df1 = df[:5]
df2 = df[5:]

In [190]:
df3 = df1

In [191]:
df3.columns

Index(['data'], dtype='object')

In [198]:
df2 = df2.reset_index(drop=True)

In [199]:
df3['data2'] = df2['data']

In [200]:
df3

   data  data2
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [201]:
df2

   data
0     6
1     7
2     8
3     9
4    10